## MultiIndex

In [3]:
import pandas as pd
import numpy as np

In [21]:
### multi-Index with daily calory intake example
days = ['Day 1', 'Day 1', 'Day 1', 'Day 2', 'Day 2', 'Day 2']
meals = [1, 2, 3, 1, 2, 3]
hierarchy_index = list(zip(days, meals))
print(hierarchy_index)

hierarchy_index = pd.MultiIndex.from_tuples(hierarchy_index)
arr = np.random.randint(500, 700, size = (6, 2))


### note that the DataFrame constructor takes DataFrame([data, index, columns, dtype, copy])
### see https://pandas.pydata.org/docs/reference/frame.html#dataframe
df = pd.DataFrame(arr, hierarchy_index, ['M', 'F'])
print(df)

[('Day 1', 1), ('Day 1', 2), ('Day 1', 3), ('Day 2', 1), ('Day 2', 2), ('Day 2', 3)]
           M    F
Day 1 1  670  672
      2  689  648
      3  502  666
Day 2 1  553  558
      2  530  624
      3  578  603

In [11]:
df.loc['Day 1']

     M    F
1  689  516
2  656  647
3  686  500

In [13]:
df.loc['Day 1'].loc[2]

M    656
F    647
Name: 2, dtype: int64

In [16]:
### Day 2, second meal, female
df.loc['Day 2'].loc[2]['F']

656

In [18]:
### assign names to 
df.index.names = ['Day', 'Meal']
df

              M    F
Day   Meal
Day 1 1     565  588
      2     506  637
      3     572  518
Day 2 1     655  641
      2     515  656
      3     633  683

In [19]:
### cross-section
df.xs('Day 2')

        M    F
Meal
1     655  641
2     515  656
3     633  683

In [20]:
### first meal for both days
df.xs(1, level='Meal')

         M    F
Day
Day 1  565  588
Day 2  655  641

In [26]:
dict_cal = {'A': ['Day 1', 'Day 1', 'Day 1', 'Day 2', 'Day 2', 'Day 2'],
        'B': [1, 2, 3, 1, 2, 3],
        'C': ['M', 'F', 'M', 'F', 'M', 'F'],
        'D': [1, 2, 3, 4, 5, 6]
}

df_cal = pd.DataFrame(dict_cal)
df_cal

       A  B  C  D
0  Day 1  1  M  1
1  Day 1  2  F  2
2  Day 1  3  M  3
3  Day 2  1  F  4
4  Day 2  2  M  5
5  Day 2  3  F  6

In [28]:
### pivot table ?????
df_cal.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          F    M
A     B
Day 1 1  NaN  1.0
      2  2.0  NaN
      3  NaN  3.0
Day 2 1  4.0  NaN
      2  NaN  5.0
      3  6.0  NaN